**Ashmika Gupte(33228)**

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
path = "/content/drive/MyDrive/Automobile_data.csv"
df = pd.read_csv(path)

In [ ]:
df

    index      company   body-style  ...  horsepower  average-mileage    price
0       0  alfa-romero  convertible  ...         111               21  13495.0
1       1  alfa-romero  convertible  ...         111               21  16500.0
2       2  alfa-romero    hatchback  ...         154               19  16500.0
3       3         audi        sedan  ...         102               24  13950.0
4       4         audi        sedan  ...         115               18  17450.0
..    ...          ...          ...  ...         ...              ...      ...
56     81   volkswagen        sedan  ...          85               27   7975.0
57     82   volkswagen        sedan  ...          52               37   7995.0
58     86   volkswagen        sedan  ...         100               26   9995.0
59     87        volvo        sedan  ...         114               23  12940.0
60     88        volvo        wagon  ...         114               23  13415.0

[61 rows x 10 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   index             61 non-null     int64
 1   company           61 non-null     object
 2   body-style        61 non-null     object
 3   wheel-base        61 non-null     float64
 4   length            61 non-null     float64
 5   engine-type       61 non-null     object
 6   num-of-cylinders  61 non-null     object
 7   horsepower        61 non-null     int64
 8   average-mileage   61 non-null     int64
 9   price             58 non-null     float64
dtypes: float64(3), int64(3), object(4)
memory usage: 4.9+ KB

In [ ]:
df.describe()

           index  wheel-base  ...  average-mileage         price
count  61.000000   61.000000  ...        61.000000     58.000000
mean   40.885246   98.481967  ...        25.803279  15387.000000
std    25.429706    6.679234  ...         8.129821  11320.259841
min     0.000000   88.400000  ...        13.000000   5151.000000
25%    18.000000   94.500000  ...        19.000000   6808.500000
50%    39.000000   96.300000  ...        25.000000  11095.000000
75%    61.000000  101.200000  ...        31.000000  18120.500000
max    88.000000  120.900000  ...        47.000000  45400.000000

[8 rows x 6 columns]

**Exercise 1: From the given dataset print the first and last five rows**

In [ ]:
df.head()

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0
3      3         audi        sedan  ...         102               24  13950.0
4      4         audi        sedan  ...         115               18  17450.0

[5 rows x 10 columns]

In [ ]:
df.tail()

    index     company body-style  ...  horsepower  average-mileage    price
56     81  volkswagen      sedan  ...          85               27   7975.0
57     82  volkswagen      sedan  ...          52               37   7995.0
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[5 rows x 10 columns]

**Exercise 2: Find the most expensive car company name**

In [ ]:
index=df['price'].argmax()
print("Company name of the most expensive car : ",df["company"].iloc[index])
print("Price of the most expensive car        : ",df["price"].iloc[index])

Company name of the most expensive car :  mercedes-benz
Price of the most expensive car        :  45400.0

**Exercise 3: Print All Toyota Cars details**

In [ ]:
df.loc[df['company'] == 'toyota']

    index company body-style  ...  horsepower  average-mileage    price
48     66  toyota  hatchback  ...          62               35   5348.0
49     67  toyota  hatchback  ...          62               31   6338.0
50     68  toyota  hatchback  ...          62               31   6488.0
51     69  toyota      wagon  ...          62               31   6918.0
52     70  toyota      wagon  ...          62               27   7898.0
53     71  toyota      wagon  ...          62               27   8778.0
54     79  toyota      wagon  ...         156               19  15750.0

[7 rows x 10 columns]

**Exercise 4: Count total cars per company**

In [ ]:
print("Total cars per company : ")
df['company'].value_counts()

Total cars per company :

toyota           7
bmw              6
mazda            5
nissan           5
mercedes-benz    4
volkswagen       4
audi             4
mitsubishi       4
jaguar           3
alfa-romero      3
honda            3
chevrolet        3
porsche          3
isuzu            3
volvo            2
dodge            2
Name: company, dtype: int64

**Exercise 5: Find each company’s Highest price car**

In [ ]:
companies = df.groupby('company')
print("Each company's highest price car : ")
highest = companies['price'].max()
highest

Each company's highest price car :

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

**Exercise 6: Find the average mileage of each car making company**

In [ ]:
print("Average mileage of each company : ")
avg_mileage = companies['average-mileage'].mean()
avg_mileage

Average mileage of each company :

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

**Exercise 7: Sort all cars by Price column**

In [ ]:
df.sort_values("price")

    index        company body-style  ...  horsepower  average-mileage    price
13     16      chevrolet  hatchback  ...          48               47   5151.0
27     36          mazda  hatchback  ...          68               30   5195.0
48     66         toyota  hatchback  ...          62               35   5348.0
36     49     mitsubishi  hatchback  ...          68               37   5389.0
28     37          mazda  hatchback  ...          68               31   6095.0
..    ...            ...        ...  ...         ...              ...      ...
11     14            bmw      sedan  ...         182               16  41315.0
35     47  mercedes-benz    hardtop  ...         184               14  45400.0
22     31          isuzu      sedan  ...          70               38      NaN
23     32          isuzu      sedan  ...          70               38      NaN
47     63        porsche  hatchback  ...         288               17      NaN

[61 rows x 10 columns]

**Exercise 8: Concatenate two data frames using the following conditions**

In [ ]:
GermanCars= {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
df1=pd.DataFrame(GermanCars)
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
df2=pd.DataFrame(japaneseCars)

In [ ]:
df1

    Company   Price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400

In [ ]:
df2

       Company  Price
0       Toyota  29995
1        Honda  23600
2       Nissan  61500
3  Mitsubishi   58900

In [ ]:
df3 = pd.concat([df1, df2], keys=["Germany", "Japan"])
df3

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900